skorburo-sql-task/skorburo-sql-task.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-25 Mon 15:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org60cd782">1. solution</a>
<ul>
<li><a href="#org19530cf">1.1. create table</a></li>
<li><a href="#org12c12c6">1.2. ChatGPT support</a>
<ul>
<li><a href="#org47955a8">1.2.1. request 1</a></li>
<li><a href="#orgceeb591">1.2.2. answer 1</a></li>
<li><a href="#org03314de">1.2.3. request 2</a></li>
<li><a href="#orgc9e040a">1.2.4. answer 2</a></li>
<li><a href="#org46920a6">1.2.5. answer 3 - combination of request 1 and request 2</a></li>
<li><a href="#org737ed8d">1.2.6. request 4</a></li>
<li><a href="#org6004d49">1.2.7. answer 4</a></li>
</ul>
</li>
<li><a href="#orgfd66036">1.3. test answer 1  - failed</a></li>
<li><a href="#org91c742a">1.4. test answer 3 - success</a></li>
<li><a href="#org14141d3">1.5. test answer 4 - success</a></li>
</ul>
</li>
<li><a href="#org5a2ec80">2. final solution</a>
<ul>
<li><a href="#orge9af53f">2.1. explanation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Есть таблица TABLE_APPLICATIONS, содержащая все заявки
 на кредиты со всех банков, то есть каждый раз, когда клиент приходит
 в какой-нибудь банк, в таблице появляется строчка.
</p>

<p>
Список полей таблицы:
</p>
<ul class="org-ul">
<li>Applicat_ID – уникальный идентификатор заявки</li>
<li>Applicat_Date – Дата заявки с точностью до секунды</li>
<li>Bank_Name – название банка</li>
<li>Passport_Number – номер паспорта клиента</li>
</ul>

<p>
Задание. Посещение банков.
</p>
<ul class="org-ul">
<li>Вывести паспорта всех клиентов, у которых в жизни была следующая
ситуация: клиент пришел в Альфабанк, а до этого никогда не посещал
ХоумКредит.</li>
</ul>



<div id="outline-container-org60cd782" class="outline-2">
<h2 id="org60cd782"><span class="section-number-2">1.</span> solution</h2>
<div class="outline-text-2" id="text-1">
<p>
Другими словая это задание: Вывести уникальные passport_number у которых есть есть запись
 Bank_Name равная 'Альфабанк' но у других записей c этим
 passport_number, у которых Applicat_Date меньше, Bank_Name != 'ХоумКредит'.
</p>

<p>
Нужно составить SQL select запрос.
</p>

<p>
Here is a SQL table
</p>
</div>
<div id="outline-container-org19530cf" class="outline-3">
<h3 id="org19530cf"><span class="section-number-3">1.1.</span> create table</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sqlite" id="org40d6aa8">DROP TABLE table_applications;

CREATE TABLE table_applications (
Applicat_ID INTEGER PRIMARY KEY, -- уникальный идентификатор посещения
Applicat_Date INTEGER, -- epoch -- Дата посещения
Bank_Name TEXT, -- название банка
Passport_Number VARCHAR(30) -- номер паспорта клиента
);

INSERT INTO table_applications VALUES(NULL, 2147483640, 'Альфабанк', '999999900');
INSERT INTO table_applications VALUES(NULL, 2147483645, 'ХоумКредит', '999999900');

INSERT INTO table_applications VALUES(NULL, 2147483639, 'ХоумКредит', '0733223445');
INSERT INTO table_applications VALUES(NULL, 2147483640, 'ХоумКредит', '0733223445');
INSERT INTO table_applications VALUES(NULL, 2147483641, 'Альфабанк', '0733223445');
INSERT INTO table_applications VALUES(NULL, 2147483645, 'ХоумКредит', '0733223445');

INSERT INTO table_applications VALUES(NULL, 2147483641, 'Альфабанк', '1133223411');
INSERT INTO table_applications VALUES(NULL, 2147483647, 'Альфабанк', '1133223411');

SELECT * FROM table_applications;
</pre>
</div>
</div>
</div>

<div id="outline-container-org12c12c6" class="outline-3">
<h3 id="org12c12c6"><span class="section-number-3">1.2.</span> ChatGPT support</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org47955a8" class="outline-4">
<h4 id="org47955a8"><span class="section-number-4">1.2.1.</span> request 1</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-text">Here is a SQL table
    CREATE TABLE table_applications (
    Applicat_ID INTEGER PRIMARY KEY, -- уникальный идентификатор посещения
    Applicat_Date INTEGER, -- epoch -- Дата посещения
    Bank_Name TEXT, -- название банка
    Passport_Number VARCHAR(30) -- номер паспорта клиента
    );

    Задание: Вывести паспорта всех клиентов, которые приходили в Альфабанк, а до этого никогда не
    посещали
     ХоумКредит.

    Другими словая это задание: Вывести уникальные passport_number у которых есть есть запись
     Bank_Name равная 'Альфабанк' но у других записей c этим
     passport_number, у которых Applicat_Date меньше, Bank_Name != 'ХоумКредит'.

    Cоставь SQL select запрос. Объяснить как если бы ты его составлял поэтапно с логической цепочкой
    рассуждений.
</pre>
</div>
</div>
</div>
<div id="outline-container-orgceeb591" class="outline-4">
<h4 id="orgceeb591"><span class="section-number-4">1.2.2.</span> answer 1</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Чтобы выполнить данное задание, нужно последовательно следовать данным требованиям с
    использованием подзапросов:
</p>

<ol class="org-ol">
<li>Начнем с выбора всех уникальных номеров паспортов
(passport_number), у которых есть запись с `Bank_Name` равным
'Альфабанк':</li>
</ol>

<div class="org-src-container">
<pre class="src src-sql">SELECT DISTINCT Passport_Number
    FROM table_applications
    WHERE Bank_Name = 'Альфабанк';
</pre>
</div>

<ol class="org-ol">
<li>Далее нам нужно проверить, что для этих номеров паспортов нет
записей, у которых `Bank_Name` равно 'ХоумКредит' и `Applicat_Date`
меньше, чем у записей для 'Альфабанк'. Для этого используем подзапрос
в операторе NOT IN:</li>
</ol>

<div class="org-src-container">
<pre class="src src-sql">    SELECT DISTINCT Passport_Number
    FROM table_applications
    WHERE Bank_Name = 'Альфабанк'
    AND Passport_Number NOT IN (
        SELECT Passport_Number
        FROM table_applications
        WHERE Bank_Name = 'ХоумКредит'
        AND Applicat_Date &lt;
            (SELECT MIN(Applicat_Date)
             FROM table_applications
             WHERE Bank_Name = 'Альфабанк'
             AND Passport_Number = table_applications.Passport_Number)
    );
</pre>
</div>

<p>
```sql
</p>

<p>
```
</p>

<p>
Этот запрос позволит вывести уникальные номера паспортов клиентов, которые посещали Альфабанк,
но не посещали ХоумКредит.
</p>

<p>
Таким образом, вы поэтапно создаете логическую цепочку запросов, чтобы выбрать нужную информацию
из базы данных.
</p>
</div>
</div>

<div id="outline-container-org03314de" class="outline-4">
<h4 id="org03314de"><span class="section-number-4">1.2.3.</span> request 2</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
What approch can you suggest to build this SELECT request, dont build it yourself but explain
    how would you select approch to build it?
</p>
</div>
</div>
<div id="outline-container-orgc9e040a" class="outline-4">
<h4 id="orgc9e040a"><span class="section-number-4">1.2.4.</span> answer 2</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
To build the SELECT request to achieve the desired outcome, you would
 need to use a combination of subqueries, joins, and the GROUP BY
 clause. Here is an outline of the approach:
</p>

<ol class="org-ol">
<li>Use a subquery to select the passport numbers of clients who visited 'Альфабанк'.</li>
<li>Join the table with itself based on the passport numbers to find
other records with the same passport number.</li>
<li>Filter the joined results to include only those where the
Applicat_Date is less than the visited date at 'Альфабанк' and the
Bank_Name is not 'ХоумКредит'.</li>
<li><p>
Group the results by passport number to get unique passport
numbers.
</p>

<p>
By following this approach, you can identify and retrieve the
passport numbers of clients who visited 'Альфабанк' but never visited
'ХоумКредит' before.
</p></li>
</ol>
</div>
</div>
<div id="outline-container-org46920a6" class="outline-4">
<h4 id="org46920a6"><span class="section-number-4">1.2.5.</span> answer 3 - combination of request 1 and request 2</h4>
</div>
<div id="outline-container-org737ed8d" class="outline-4">
<h4 id="org737ed8d"><span class="section-number-4">1.2.6.</span> request 4</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
Упрости этот запрос, чтобы SELECT вы выполнял подзапросы, чтобы не было подциклов.
</p>
</div>
</div>
