skorburo-sql-task/skorburo-sql-task.org
*** answer 4
Для упрощения запроса и избежания подциклов можно использовать JOIN вместо подзапросов. Вот
    упрощенный запрос:

    SELECT DISTINCT t1.Passport_Number
    FROM table_applications t1
    LEFT JOIN table_applications t2
        ON t1.Passport_Number = t2.Passport_Number
        AND t2.Applicat_Date < t1.Applicat_Date
        AND t2.Bank_Name = 'ХоумКредит'
    WHERE t1.Bank_Name = 'Альфабанк'
        AND t2.Passport_Number IS NULL;


    Этот запрос использует LEFT JOIN для соединения таблицы table_applications саму с собой по
    условиям, указанным в JOIN. Затем он фильтрует строки, где соединение не удалось (т.е. где нет
    соответствующей записи в таблице t2), и выводит уникальные Passport_Number из заявок в
    Альфабанк, которые не имеют соответствующих заявок в ХоумКредит с более ранней датой.
** test answer 1  - failed
#+name: test1
#+begin_src sqlite :db /tmp/test-sqlite.db :colnames yes :exports both
SELECT DISTINCT Passport_Number
    FROM table_applications
    WHERE Bank_Name = 'Альфабанк'
    AND Passport_Number NOT IN (
        SELECT Passport_Number
        FROM table_applications
        WHERE Bank_Name = 'ХоумКредит'
        AND Applicat_Date <
            (SELECT MIN(Applicat_Date)
             FROM table_applications
             WHERE Bank_Name = 'Альфабанк'
             AND Passport_Number = table_applications.Passport_Number)
    );
#+end_src

#+RESULTS: step 1: select subspace
| Passport_Number |
|-----------------|
|       999999900 |
|       733223445 |
|      1133223411 |

Fail. Не верно.
** test answer 3 - success
#+name: test2
#+begin_src sqlite :db /tmp/test-sqlite.db :colnames yes
SELECT DISTINCT t1.Passport_Number
    FROM table_applications t1
    WHERE t1.Bank_Name = 'Альфабанк'
    AND NOT EXISTS (
        SELECT 1
        FROM table_applications t2
        WHERE t2.Passport_Number = t1.Passport_Number
        AND t2.Applicat_Date < t1.Applicat_Date
        AND t2.Bank_Name = 'ХоумКредит'
    );
#+end_src

#+RESULTS: test2

Success! Успех!

Select 1 - вовращает константу

#+name: test3
#+begin_src sqlite :db /tmp/test-sqlite.db :colnames yes :exports both
SELECT 1
        FROM table_applications t2
        WHERE t2.Bank_Name = 'ХоумКредит'
#+end_src

#+RESULTS: test3
| 1 |
|---|
| 1 |
| 1 |
| 1 |
