skorburo-sql-task/skorburo-sql-task.html
<div id="outline-container-org6004d49" class="outline-4">
<h4 id="org6004d49"><span class="section-number-4">1.2.7.</span> answer 4</h4>
<div class="outline-text-4" id="text-1-2-7">
<p>
Для упрощения запроса и избежания подциклов можно использовать JOIN вместо подзапросов. Вот
    упрощенный запрос:
</p>

<p>
SELECT DISTINCT t1.Passport_Number
FROM table_applications t1
LEFT JOIN table_applications t2
    ON t1.Passport_Number = t2.Passport_Number
    AND t2.Applicat_Date &lt; t1.Applicat_Date
    AND t2.Bank_Name = 'ХоумКредит'
WHERE t1.Bank_Name = 'Альфабанк'
    AND t2.Passport_Number IS NULL;
</p>


<p>
Этот запрос использует LEFT JOIN для соединения таблицы table_applications саму с собой по
условиям, указанным в JOIN. Затем он фильтрует строки, где соединение не удалось (т.е. где нет
соответствующей записи в таблице t2), и выводит уникальные Passport_Number из заявок в
Альфабанк, которые не имеют соответствующих заявок в ХоумКредит с более ранней датой.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfd66036" class="outline-3">
<h3 id="orgfd66036"><span class="section-number-3">1.3.</span> test answer 1  - failed</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-sqlite" id="org22117a2">SELECT DISTINCT Passport_Number
    FROM table_applications
    WHERE Bank_Name = 'Альфабанк'
    AND Passport_Number NOT IN (
        SELECT Passport_Number
        FROM table_applications
        WHERE Bank_Name = 'ХоумКредит'
        AND Applicat_Date &lt;
            (SELECT MIN(Applicat_Date)
             FROM table_applications
             WHERE Bank_Name = 'Альфабанк'
             AND Passport_Number = table_applications.Passport_Number)
    );
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Passport_Number</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">999999900</td>
</tr>

<tr>
<td class="org-right">733223445</td>
</tr>

<tr>
<td class="org-right">1133223411</td>
</tr>
</tbody>
</table>

<p>
Fail. Не верно.
</p>
</div>
</div>
<div id="outline-container-org91c742a" class="outline-3">
<h3 id="org91c742a"><span class="section-number-3">1.4.</span> test answer 3 - success</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-sqlite" id="org6c5f550">SELECT DISTINCT t1.Passport_Number
    FROM table_applications t1
    WHERE t1.Bank_Name = 'Альфабанк'
    AND NOT EXISTS (
        SELECT 1
        FROM table_applications t2
        WHERE t2.Passport_Number = t1.Passport_Number
        AND t2.Applicat_Date &lt; t1.Applicat_Date
        AND t2.Bank_Name = 'ХоумКредит'
    );
</pre>
</div>

<p>
Success! Успех!
</p>

<p>
Select 1 - вовращает константу
</p>

<div class="org-src-container">
<pre class="src src-sqlite" id="orgbd5ca65">SELECT 1
        FROM table_applications t2
        WHERE t2.Bank_Name = 'ХоумКредит'
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">1</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
</div>
</div>
