skorburo-sql-task/skorburo-sql-task.org
** test answer 4 - success
#+name: test4
#+begin_src sqlite :db /tmp/test-sqlite.db :colnames yes :exports both
SELECT DISTINCT t1.Passport_Number
    FROM table_applications t1
    LEFT JOIN table_applications t2
        ON t1.Passport_Number = t2.Passport_Number
        AND t2.Applicat_Date < t1.Applicat_Date
        AND t2.Bank_Name = 'ХоумКредит'
    WHERE t1.Bank_Name = 'Альфабанк'
        AND t2.Passport_Number IS NULL;
#+end_src

#+RESULTS: test4
| Passport_Number |
|-----------------|
|       999999900 |
|      1133223411 |


#+name: test5
#+begin_src sqlite :db /tmp/test-sqlite.db :colnames yes :exports both
SELECT DISTINCT *
    FROM table_applications t1
    LEFT JOIN table_applications t2
        ON t1.Passport_Number = t2.Passport_Number
        AND t2.Applicat_Date < t1.Applicat_Date
        AND t2.Bank_Name = 'ХоумКредит'
    -- WHERE t1.Bank_Name = 'Альфабанк'
    --     AND t2.Passport_Number IS NULL;
#+end_src

#+RESULTS: test5
| Applicat_ID | Applicat_Date | Bank_Name  | Passport_Number | Applicat_ID | Applicat_Date | Bank_Name  | Passport_Number |
|-------------+---------------+------------+-----------------+-------------+---------------+------------+-----------------|
|           1 |    2147483640 | Альфабанк  |       999999900 |             |               |            |                 |
|           2 |    2147483645 | ХоумКредит |       999999900 |             |               |            |                 |
|           3 |    2147483639 | ХоумКредит |       733223445 |             |               |            |                 |
|           4 |    2147483640 | ХоумКредит |       733223445 |           3 |    2147483639 | ХоумКредит |       733223445 |
|           5 |    2147483641 | Альфабанк  |       733223445 |           3 |    2147483639 | ХоумКредит |       733223445 |
|           5 |    2147483641 | Альфабанк  |       733223445 |           4 |    2147483640 | ХоумКредит |       733223445 |
|           6 |    2147483645 | ХоумКредит |       733223445 |           3 |    2147483639 | ХоумКредит |       733223445 |
|           6 |    2147483645 | ХоумКредит |       733223445 |           4 |    2147483640 | ХоумКредит |       733223445 |
|           7 |    2147483641 | Альфабанк  |      1133223411 |             |               |            |                 |
|           8 |    2147483647 | Альфабанк  |      1133223411 |             |               |            |                 |

Попробуем оптимизировать запрос, чтобы уменьшить талицу t2

#+name: test6
#+begin_src sqlite :db /tmp/test-sqlite.db :colnames yes :exports both
SELECT DISTINCT t1.Passport_Number
    FROM table_applications t1
    LEFT JOIN (
        SELECT Passport_Number, MIN(Applicat_Date) AS Max_Applicat_Date
        FROM table_applications
        WHERE Bank_Name = 'ХоумКредит'
        GROUP BY Passport_Number
    ) t2 ON t1.Passport_Number = t2.Passport_Number AND t2.Max_Applicat_Date < t1.Applicat_Date
    WHERE t1.Bank_Name = 'Альфабанк' AND t2.Passport_Number IS NULL;
#+end_src

#+RESULTS: test6
| Passport_Number |
|-----------------|
|       999999900 |
|      1133223411 |


Подзапрос из test6:

#+name: test7
#+begin_src sqlite :db /tmp/test-sqlite.db :colnames yes :exports both
SELECT Passport_Number, MIN(Applicat_Date) AS Max_Applicat_Date
        FROM table_applications
        WHERE Bank_Name = 'ХоумКредит'
        GROUP BY Passport_Number
#+end_src

#+RESULTS: test7
| Passport_Number | Max_Applicat_Date |
|-----------------+-------------------|
|       733223445 |        2147483639 |
|       999999900 |        2147483645 |

Как видим t2 стал меньше, что уменьшело вычисления в JOIN операции
* final solution
Хотя индексы не могут быть использоваты в подзапросах, этот подзапрос
 агрегирует записи в MIN(Applicat_Date) пред JOIN, за счет чего
 выполняется максимально эффективно.
#+name: final
#+begin_src sqlite :db /tmp/test-sqlite.db :colnames yes :exports both
SELECT DISTINCT t1.Passport_Number
    FROM table_applications t1
    LEFT JOIN (
        SELECT Passport_Number, MIN(Applicat_Date) AS Max_Applicat_Date
        FROM table_applications
        WHERE Bank_Name = 'ХоумКредит'
        GROUP BY Passport_Number
    ) t2 ON t1.Passport_Number = t2.Passport_Number AND t2.Max_Applicat_Date < t1.Applicat_Date
    WHERE t1.Bank_Name = 'Альфабанк' AND t2.Passport_Number IS NULL;
#+end_src

#+RESULTS: final
| Passport_Number |
|-----------------|
|       999999900 |
|      1133223411 |

** explanation

Это запрос выполняет LEFT JOIN на записях из оригинальной таблицы и
 подзапроса, который выбирает запись Bank_Name = 'ХоумКредит' с MIN(Applicat_Date).
Запись добавленная в правую часть, означает, что клиент посещал банк 'ХоумКредит' до этого.

Объединение выбирает записи без правой части, чтобы отобрать
 клиентов не посещавших 'ХоумКредит' до посещения 'Альфабанк'.

Последним этапом происходит выбор уникальных записей по Passport_number.
