skorburo-sql-task/skorburo-sql-task.html
<div id="outline-container-org14141d3" class="outline-3">
<h3 id="org14141d3"><span class="section-number-3">1.5.</span> test answer 4 - success</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-sqlite" id="orgde1d2bd">SELECT DISTINCT t1.Passport_Number
    FROM table_applications t1
    LEFT JOIN table_applications t2
        ON t1.Passport_Number = t2.Passport_Number
        AND t2.Applicat_Date &lt; t1.Applicat_Date
        AND t2.Bank_Name = 'ХоумКредит'
    WHERE t1.Bank_Name = 'Альфабанк'
        AND t2.Passport_Number IS NULL;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Passport_Number</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">999999900</td>
</tr>

<tr>
<td class="org-right">1133223411</td>
</tr>
</tbody>
</table>


<div class="org-src-container">
<pre class="src src-sqlite" id="org6ed102b">SELECT DISTINCT *
    FROM table_applications t1
    LEFT JOIN table_applications t2
        ON t1.Passport_Number = t2.Passport_Number
        AND t2.Applicat_Date &lt; t1.Applicat_Date
        AND t2.Bank_Name = 'ХоумКредит'
    -- WHERE t1.Bank_Name = 'Альфабанк'
    --     AND t2.Passport_Number IS NULL;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Applicat_ID</th>
<th scope="col" class="org-right">Applicat_Date</th>
<th scope="col" class="org-left">Bank_Name</th>
<th scope="col" class="org-right">Passport_Number</th>
<th scope="col" class="org-right">Applicat_ID</th>
<th scope="col" class="org-right">Applicat_Date</th>
<th scope="col" class="org-left">Bank_Name</th>
<th scope="col" class="org-right">Passport_Number</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">2147483640</td>
<td class="org-left">Альфабанк</td>
<td class="org-right">999999900</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">2147483645</td>
<td class="org-left">ХоумКредит</td>
<td class="org-right">999999900</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">2147483639</td>
<td class="org-left">ХоумКредит</td>
<td class="org-right">733223445</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">2147483640</td>
<td class="org-left">ХоумКредит</td>
<td class="org-right">733223445</td>
<td class="org-right">3</td>
<td class="org-right">2147483639</td>
<td class="org-left">ХоумКредит</td>
<td class="org-right">733223445</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">2147483641</td>
<td class="org-left">Альфабанк</td>
<td class="org-right">733223445</td>
<td class="org-right">3</td>
<td class="org-right">2147483639</td>
<td class="org-left">ХоумКредит</td>
<td class="org-right">733223445</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">2147483641</td>
<td class="org-left">Альфабанк</td>
<td class="org-right">733223445</td>
<td class="org-right">4</td>
<td class="org-right">2147483640</td>
<td class="org-left">ХоумКредит</td>
<td class="org-right">733223445</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">2147483645</td>
<td class="org-left">ХоумКредит</td>
<td class="org-right">733223445</td>
<td class="org-right">3</td>
<td class="org-right">2147483639</td>
<td class="org-left">ХоумКредит</td>
<td class="org-right">733223445</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">2147483645</td>
<td class="org-left">ХоумКредит</td>
<td class="org-right">733223445</td>
<td class="org-right">4</td>
<td class="org-right">2147483640</td>
<td class="org-left">ХоумКредит</td>
<td class="org-right">733223445</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">2147483641</td>
<td class="org-left">Альфабанк</td>
<td class="org-right">1133223411</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">2147483647</td>
<td class="org-left">Альфабанк</td>
<td class="org-right">1133223411</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Попробуем оптимизировать запрос, чтобы уменьшить талицу t2
</p>

<div class="org-src-container">
<pre class="src src-sqlite" id="org9db47dd">SELECT DISTINCT t1.Passport_Number
    FROM table_applications t1
    LEFT JOIN (
        SELECT Passport_Number, MIN(Applicat_Date) AS Max_Applicat_Date
        FROM table_applications
        WHERE Bank_Name = 'ХоумКредит'
        GROUP BY Passport_Number
    ) t2 ON t1.Passport_Number = t2.Passport_Number AND t2.Max_Applicat_Date &lt; t1.Applicat_Date
    WHERE t1.Bank_Name = 'Альфабанк' AND t2.Passport_Number IS NULL;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Passport_Number</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">999999900</td>
</tr>

<tr>
<td class="org-right">1133223411</td>
</tr>
</tbody>
</table>


<p>
Подзапрос из test6:
</p>

<div class="org-src-container">
<pre class="src src-sqlite" id="org6d5c032">SELECT Passport_Number, MIN(Applicat_Date) AS Max_Applicat_Date
        FROM table_applications
        WHERE Bank_Name = 'ХоумКредит'
        GROUP BY Passport_Number
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Passport_Number</th>
<th scope="col" class="org-right">Max_Applicat_Date</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">733223445</td>
<td class="org-right">2147483639</td>
</tr>

<tr>
<td class="org-right">999999900</td>
<td class="org-right">2147483645</td>
</tr>
</tbody>
</table>

<p>
Как видим t2 стал меньше, что уменьшело вычисления в JOIN операции
</p>
</div>
</div>
</div>
<div id="outline-container-org5a2ec80" class="outline-2">
<h2 id="org5a2ec80"><span class="section-number-2">2.</span> final solution</h2>
<div class="outline-text-2" id="text-2">
<p>
Хотя индексы не могут быть использоваты в подзапросах, этот подзапрос
 агрегирует записи в MIN(Applicat_Date) пред JOIN, за счет чего
 выполняется максимально эффективно.
</p>
<div class="org-src-container">
<pre class="src src-sqlite" id="org874fe98">SELECT DISTINCT t1.Passport_Number
    FROM table_applications t1
    LEFT JOIN (
        SELECT Passport_Number, MIN(Applicat_Date) AS Max_Applicat_Date
        FROM table_applications
        WHERE Bank_Name = 'ХоумКредит'
        GROUP BY Passport_Number
    ) t2 ON t1.Passport_Number = t2.Passport_Number AND t2.Max_Applicat_Date &lt; t1.Applicat_Date
    WHERE t1.Bank_Name = 'Альфабанк' AND t2.Passport_Number IS NULL;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Passport_Number</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">999999900</td>
</tr>

<tr>
<td class="org-right">1133223411</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orge9af53f" class="outline-3">
<h3 id="orge9af53f"><span class="section-number-3">2.1.</span> explanation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Это запрос выполняет LEFT JOIN на записях из оригинальной таблицы и
 подзапроса, который выбирает запись Bank_Name = 'ХоумКредит' с MIN(Applicat_Date).
Запись добавленная в правую часть, означает, что клиент посещал банк 'ХоумКредит' до этого.
</p>

<p>
Объединение выбирает записи без правой части, чтобы отобрать
 клиентов не посещавших 'ХоумКредит' до посещения 'Альфабанк'.
</p>

<p>
Последним этапом происходит выбор уникальных записей по Passport_number.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-03-25 Mon 15:40</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
